using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;

namespace qawpf
{
    /// <summary>
    /// QNA.xaml에 대한 상호 작용 논리
    /// </summary>
    public partial class QNA : Page
    {
        public QNA()
        {
            InitializeComponent();
        }

        private void Q1_Click(object sender, RoutedEventArgs e)
        {
            answer.Text = "국가번호(國家番號)는 국제 전화에서 각국을 식별하기 위해 부여된 번호를 말한다.\n\n" +
                "국가 번호는 지역 1부터 9까지 아홉 개로 나뉘며, 각 번호들은 해당하는 지역 번호로 시작한다.\n\n " +
                "1~3자리의 숫자로 구성되어 있다. 간혹 한 나라가 본토와 멀리 떨어진 해외 영토를 갖는 경우는 여러 국가번호를 갖기도 하고 반대로 여러 나라가 같은 국가번호를 쓰기도 한다.\n\n " +
                "이런 나라들 사이에서 국제전화를 거는 방식은 국내 시외전화를 거는 방식과 동일하다.\n\n " +
                "다만 요금까지 국내전화와 차이가 없는 것은 아니다. 바티칸에서 이탈리아 로마로 거는 국제전화는 사실상 시내전화로 취급된다.\n" +
                "\r\n국제전화를 건다고 하면 어떤 방법으로 전화를 걸든 국가번호를 처음에 넣어야 된다.\n " +
                "예를 들어 해외에서 한국으로 010-1234-5678 이라는 번호에 전화를 건다면 +821012345678 또는 +82-10-1234-5678을 입력해야 된다. " +
                "이는 대부분의 나라에서 가장 처음의 전화번호 숫자 0은 '국내 전화로 거는 것'임을 의미하는 숫자로 쓰이기 때문이다.\n\n " +
                "다만 이게 모든 나라에서 이런식으로 사용하는 것은 아니라서, 아주 극소수의 예외(이탈리아, 산마리노, 바티칸)의 경우에는 전화번호 가장 앞의 0도 포함해야 하는 경우도 있다. " +
                "이 국가들의 경우에는 가장 앞의 숫자 0이 '국내 전화로 거는 것'을 의미하는 것이 아니라, 그냥 일반적인 전화번호 자체로 사용된다. 휴대전화에서 해외로 전화를 걸고자 할 경우에는 일반적으로 '0'을 길게 누르면 +가 입력되는데, 이 이후로 국가번호, (극히 일부 국가를 제외하고) 앞자리 0을 제외한 나머지 번호를 입력하고 전화를 걸면 된다. ";
        }

        private void Q2_Click(object sender, RoutedEventArgs e)
        {
            answer.Text = "국가 코드는 알파벳이나 숫자로 된 지역 코드로, 데이터 처리와 통신을 목적으로 나라와 속령을 나타내기 위해 개발되었다.\nISO 3166이라 칭하며, 전 세계의 나라와 부속 영토, 나라의 주요 구성 단위의 명칭에 고유 부호를 부여하는 국제 표준으로 세 가지 세부 표준으로 구성된다.\n\n"+
                "ISO 3166 - 1 alpha - 2 두 자리 국가코드\nISO 3166 - 1 alpha - 3 세 자리 국가코드\nISO 3166 - 1 numeric 세 자리(숫자) 국가번호\n\n" +
                "이 프로그램에서 사용되는 국가코드는 ISO 3166-1 Alpha-3으로, ISO 3166-1에서 정한 알파벳 세 글자의 국가 코드로 나타낸 것이다. 세 자리 국가코드는 아래와 같이 표시된다.\n\n" +
                "ex)\n프랑스 : FRA\n오스트리아 : AUT\n미국 : USA\n스페인 : ESP\n스위스 : CHE\n영국 : GBR\n일본 : JPN\n중국 : CHN\n태국 : THA\n가나 : GHA";
        }

        private void Q3_Click(object sender, RoutedEventArgs e)
        {
            answer.Text = "여행경보제도(旅行警報制度)는 국가에서 자국민 또는 외국인에게 특정 국가 또는 지역으로의 여행을 경고하거나 제한하는 제도이다. 2004년 1월 16일에 시행되었다.\n\n" +
                "주로 다른 국가의 정치 사회적 불안 및 내전, 치안 미비 등을 고려하여 실시되고 있으며, 대한민국에서도 여행금지국가를 법적으로 지정하여 국민들의 안전 보장을 목적으로 기본권을 일부 제한하고 있다. 이는 여행의 자유보다 국민의 안전이라는 권익이 더 크기 때문이다.\n\n" +
                "대한민국에서는 외교부에서 여행경보제도라는 이름으로 운용 중이며, 총 4단계로 나뉜다.\n" +
                "경보가 없는 국가들은 한국인이나 다른 외국인들의 신변이 직접적으로 위협받은 사례나 위협받을 만한 국가급 사건사고가 없어서 경보가 내려지지 않았을 뿐이며," +
                "전 세계 어디를 가더라도 개인 신변에 항상 유의해야 하는 것은 기본이다.\r\n\n" +
                "1단계 여행유의: 국내 대도시보다 상당히 높은 수준의 위험. 체류자는 신변안전 위험 요인 숙지 및 대비.\r\n\n" +
                "2단계 여행자제: 국내 대도시보다 매우 높은 수준의 위험. 불필요한 여행 자제[7], 체류자는 신변안전 특별유의. (황색)\r\n\n" +
                "3단계 출국권고: 국민의 생명과 안전을 위협하는 심각한 수준의 위험. 여행 취소 또는 연기, 체류자는 긴급히 중요한 용무가 아닌 한 출국. (적색)\r\n\n" +
                "4단계 여행금지: 국민의 생명과 안전을 위협하는 매우 심각한 수준의 위험. 여행금지 준수, 체류자는 즉시 대피 및 철수. (흑색)";
        }

        private void Q4_Click(object sender, RoutedEventArgs e)
        {
            answer.Text = "여행을 꼭 가야 한다면 여행경보가 발령된 국가 중 그나마 가장 안전한 곳이다. 단순히 여행 계획이 있거나, 있을 것이라면 위험할 수 있다는 것 정도는 미리 알고 가는 것이 좋다. 국가 전체적으로는 안전하지만 테러가 벌어지거나, 일시적인 범죄 증가나 정세불안으로 여행유의 등급이 발령되는 경우도 있어, 비교적 안전하다 인식되는 선진국에도 심심찮게 경보가 내려지곤 한다.\r\n\n" +
                "적어도 주의는 하고 가는 것이 좋은 지역들로, 인도, 바레인, 태국처럼 시위가 아직도 빈번하게 일어나는 곳들이나, 대규모 시위가 일어날 때도 있는 나라/지역들이 주로 해당되며 벨기에 몰렌베크생장, 네팔처럼 일부 지역의 상황이 좋지 않는 곳들이 주로 여행유의 국가로 지정되어 있다.\r\n\r\n" +
                "영사관의 위치와 연락처, 그리고 현지에서의 연락 방법 정도는 알아두고, 낮에는 관광지, 근무지로부터 멀리 벗어나지 말고 항상 주변을 경계하고, 밤에는 호텔, 기숙사 등 숙박지에서 벗어나지 않으면 안전한 여행이 될 수 있다. 현지 국가 입장에서도 외국인들이 자주 머무는 곳은 국가 수입과 직결되는 곳이므로 선진국 수준의 치안을 유지하려 하지만, 이런 곳에서 조금만 벗어나도 현지 사정에 따라 치안이 관리되기에 관광객이 범죄에 노출될 가능성이 높아지므로 주의해야 한다.";
        }

        private void Q5_Click(object sender, RoutedEventArgs e)
        {
            answer.Text = "여행 목적의 방문이라면, 정말 여기 꼭 여행을 가야 하는지 다시 한 번 생각해보는 것이 좋다. 가급적 타국을 자극하지 않는 걸 원칙으로 하는 대한민국 외교부에서 특정국 상대로 여행자제를 내릴 정도면 도저히 경보를 내리지 않고 그냥 넘어갈 수 없어서 그런 것이므로 생각보다 위험한 곳이다.\r\n\n" +
                "필리핀처럼 한국인이 수시로 죽어나가도 현지 정부가 나몰라라 할 정도거나 파푸아뉴기니처럼 아예 반 무법천지는 되어야 여행자제가 나온다. 한국에서는 파푸아뉴기니의 전 지역이 여행자제이지만 극히 일부 지역은 \"여행자제\"보다 더 위험한, 출국권고에 준하는 구역도 있으며, 이곳에 가면 영원히 못 돌아올 가능성이 높다. " +
                "호주에서는 파푸아뉴기니의 내륙 일부 구역들을 3단계로 했고, 일본에서는 부건빌 섬 남부 지역은 파푸아뉴기니보다 좀 더 위험한 구역으로 보고 있다. 결국 한국도 파푸아뉴기니의 서던하일랜즈 주, 헬라 주가 3단계인 출국권고로 강화되었다.\r\n\n" +
                "물론 여행자제가 내려진 지역 중에서도 관광할 만한 곳이 없는 것은 아니다. 그 중에서는 필리핀,이스라엘 같이 한국인 관광객은 물론, 전 세계에서 수많은 관광객들이 오는 나라들도 있다. 멕시코의 아카풀코는 해마다 수많은 관광객들이 찾아오고 있는데, 성수기에는 아예 계엄령을 발동하여 관광객들을 보호하고 있으며, 미초아칸 주의 모렐리아와 모나크 왕나비가 찾아오는 시타쿠아로(Zitácuaro)는 여행자제지역이 맞나 싶을 정도로 안정적인 곳도 있다.\r\n\n" +
                "여행 전에 정보를 최대한 많이 수집하고, 해당 지역에 들어간 이후에는 항상 신중하며 여행하는 것이 좋다. 현지 언어에 능통하지 못하거나, 정보 수집에 자신이 없으면 여행사를 통해 대략의 코스와 교통편을 예약하고 가는 것이 좋으며, 그것마저도 자신 없으면 패키지로 여행하는 것이 최선이다. 사업상 방문이라면 어쩔 수 없으므로 현지 치안 상태에 대해 뉴스를 수집하는 등 최선을 다해 신변 안전에 유의하는 것도 좋은 방법이다.";
        }

        private void Q6_Click(object sender, RoutedEventArgs e)
        {
            answer.Text = "긴급한 용무가 아닌 이상, 특히, 관광이 목적이라면 절대 들어가지 않는 것이 좋으며, 여행 계획이 있다면 가급적이면 취소하거나 연기해야 한다. 현지에 체류 중이라면 긴급한 용무가 아닌 이상 안전한 지역으로 신속하게 대피해야 한다.\r\n\r\n" +
                "여기서부턴 진짜로 위험해서 목숨을 보장할 수 없어 발령되는 경보이다.\r\n\r\n" +
                "3단계라 하더라도 아래의 여행금지국가와 맞먹을 정도로 위험한 곳들이 상당히 많다. 일명 파탄국가로 일컬어지는 국가 또는 인외마경급 지역들은 거의 3단계 이상이라고 보면 되며, 일본 후쿠시마현도 그 지역만 놓고 보면 예외는 아니다." +
                " 결국은 이 이상부터는 아예 아래의 특별여행경보로 생각하면 편하다. 나무위키에서도 3단계 출국권고부터 해당하는 지역을 표기하는데, 3단계 이상으로 발령된 지역은 현지 여건이 현저히 개선되지 않는 한, 경보가 해제되거나 완화되지 않기에 표기가 용이하기 때문이다. 물론 해당 국가 또는 지역의 위험성을 알리려는 용도도 있다.\r\n\r\n" +
                "여행금지와는 다르게, 들어가거나 현지에서 철수하지 않는 것을 법으로까지 막지는 않고, 처벌도 하지 않는다. 출국권고의 경우, 들어가는 것 자체는 불법이 아니지만, 진짜 위험한 지역이라는 뜻이다. 헬게이트가 되었거나 될 가능성이 매우 높은 지역에 떨어지는 구분으로, " +
                "여기까지 가면 외부에서 들어가는 것은 최대한 자제해야 하며, 내부에 있던 사람들은 특별한 사유가 없는 이상 철수하는 것이 좋은 수준이다.";
        }
    }
}